docs/posts/2025-07-14-moral-imagination.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Jul 14, 2025 05:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>On Moral Imagination</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">On Moral Imagination
<br />
<span class="subtitle">Jul 14, 2025 05:27</span>
</h1>
<p>
Jennifer Finney Boylan, in <a href="https://www.washingtonpost.com/opinions/2025/07/13/superman-fd-christopher-reeve-father-jor-el/?carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F439ab12%2F6874d524d2a65e78271600dc%2F596a35569bbc0f0e09e8239c%2F29%2F64%2F6874d524d2a65e78271600dc">The Washington Post</a>:
</p>

<blockquote>
<p>
It’s moral imagination that has provided me with some solace, these past six months, as I try to understand the sense of fear that people like me appear to trigger in others.
</p>

<p>
It’s moral imagination that I have tried to ask others to have, when they set about trying to erase people such as me from the public sphere.
</p>

<p>
If we are ever to build a more perfect nation, surely this project will begin by opening our hearts to each other, by using our imaginations to understand that there is more than one way of being human, more than one way of being in the world.
</p>
</blockquote>

<div class="tagline" id="org74bdfff">
<p>
Tagged:  <a href="../tags/ethics.html">Ethics</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jul 14, 2025 05:30.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
