drafts/2025-07-14-moral-imagination.tex
% Created 2025-07-14 Mon 05:28
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Randy Ridenour}
\date{\textit{<2025-07-14 Mon 05:27>}}
\title{On Moral Imagination}
\hypersetup{
 pdfauthor={Randy Ridenour},
 pdftitle={On Moral Imagination},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={},
 pdflang={English}}
\usepackage{biblatex}
\addbibresource{~/Dropbox/bibtex/rlr.bib}
\begin{document}

\maketitle
Jennifer Finney Boylan, in \href{https://www.washingtonpost.com/opinions/2025/07/13/superman-fd-christopher-reeve-father-jor-el/?carta-url=https\%3A\%2F\%2Fs2.washingtonpost.com\%2Fcar-ln-tr\%2F439ab12\%2F6874d524d2a65e78271600dc\%2F596a35569bbc0f0e09e8239c\%2F29\%2F64\%2F6874d524d2a65e78271600dc}{The Washington Post}:

\begin{quote}
It’s moral imagination that has provided me with some solace, these past six months, as I try to understand the sense of fear that people like me appear to trigger in others.

It’s moral imagination that I have tried to ask others to have, when they set about trying to erase people such as me from the public sphere.

If we are ever to build a more perfect nation, surely this project will begin by opening our hearts to each other, by using our imaginations to understand that there is more than one way of being human, more than one way of being in the world.
\end{quote}

\begin{tagline}
Tagged: 
\end{tagline}
\end{document}
